# Python Pandas

### In Part we are going to learn about

### Pandas Dataframe
### Pandas Series
### Pandas Basic Operations

In [3]:
#import libraries
import numpy as np

In [7]:
import pandas as pd

In [ ]:
#creating data
np.arange(0,20).reshape(5,4)

In [68]:
#Creating a dataframe
df=pd.DataFrame(data=np.arange(0,20).reshape(5,4),index=["row1","row2","row3","row4","row5"],columns=['col1','col2','col3','col4'])

In [70]:
df.head()  #✅ df.head(n) → Returns the first n rows of a DataFrame (default is 5).

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [48]:
df.tail() #✅ df.tail(n) → Returns the last n rows of a DataFrame (default is 5).

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row5    12    13    14    15
row5    16    17    18    19

In [50]:
type(df)

pandas.core.frame.DataFrame

In [52]:
df.info()   #✅ df.info() → Provides a concise summary of the DataFrame, including the number of non-null entries, column data types, and memory usage.

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, row1 to row5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int32
 1   col2    5 non-null      int32
 2   col3    5 non-null      int32
 3   col4    5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [54]:
df.describe()  #✅ df.describe() → Generates descriptive statistics (count, mean, std, min, 25%, 50%, 75%, max) for numeric columns in a DataFrame.

            col1       col2       col3       col4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [56]:
##Indexing
## columnname,rowindex[loc],rowindex columnindex number[.iloc]
df.head()

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row5    12    13    14    15
row5    16    17    18    19

In [62]:
##columnname
type(df['col1'])

pandas.core.series.Series

In [64]:
df[['col1','col2','col3']]

      col1  col2  col3
row1     0     1     2
row2     4     5     6
row3     8     9    10
row5    12    13    14
row5    16    17    18

In [72]:
##using row index name loc
df.loc[['row3','row4']]

      col1  col2  col3  col4
row3     8     9    10    11
row4    12    13    14    15

In [74]:
df.iloc[2:4,0:2]

      col1  col2
row3     8     9
row4    12    13

In [76]:
df.iloc[2:,1:]

      col2  col3  col4
row3     9    10    11
row4    13    14    15
row5    17    18    19

In [78]:
##convert dataframe into arrays
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [80]:
## Basic operations
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
dtype: int64

In [82]:
df=pd.DataFrame(data=[[1,np.nan,2],[1,3,4]],index=["Row1",
                                                      "Row2"],columns=["Column1",
                                                                             "Column2",
                                                                             "Column3",
                                                                             ])

In [84]:
df.isnull().sum()

Column1    0
Column2    1
Column3    0
dtype: int64

In [86]:
df.isnull().sum()==0

Column1     True
Column2    False
Column3     True
dtype: bool

In [88]:
df

      Column1  Column2  Column3
Row1        1      NaN        2
Row2        1      3.0        4

In [90]:
df['Column3'].value_counts()

Column3
2    1
4    1
Name: count, dtype: int64

In [92]:
df['Column2'].unique()

array([nan,  3.])

In [94]:
df[df['Column2']>2]

      Column1  Column2  Column3
Row2        1      3.0        4